case/outputs_steady/openfoam_cases/section_1_x3p0km/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| SHCT->OpenFOAM coupling — auto-generated case                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 0 -1 0 0 0 0];
internalField uniform 11.7912;

boundaryField
{
    inlet   { type fixedValue; value uniform 11.7912; }
    outlet  { type inletOutlet; inletValue uniform 11.7912; value uniform 11.7912; }
    walls   { type omegaWallFunction; value uniform 11.7912; }
}
